; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   microwavetype sinkbasintype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   countertoptype sidetabletype desktype - receptacletype
   baseballbattype tomatotype ladletype mugtype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   countertop_1 sidetable_2 microwave_3 desk_4 microwave_5 microwave_6 fridge_7 - receptacle
   baseballbat_1 tomato_2 ladle_3 baseballbat_4 mug_5 - obj
 )
 (:init (receptacletype_0 countertop_1 countertoptype) (receptacletype_0 sidetable_2 sidetabletype) (receptacletype_0 microwave_3 microwavetype) (receptacletype_0 desk_4 desktype) (receptacletype_0 microwave_5 microwavetype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 baseballbat_1 baseballbattype) (objecttype_0 tomato_2 tomatotype) (objecttype_0 ladle_3 ladletype) (objecttype_0 baseballbat_4 baseballbattype) (objecttype_0 mug_5 mugtype) (cancontain countertoptype baseballbattype) (cancontain countertoptype tomatotype) (cancontain countertoptype ladletype) (cancontain countertoptype mugtype) (cancontain sidetabletype baseballbattype) (cancontain sidetabletype tomatotype) (cancontain sidetabletype ladletype) (cancontain sidetabletype mugtype) (cancontain microwavetype tomatotype) (cancontain microwavetype mugtype) (cancontain desktype mugtype) (cancontain fridgetype tomatotype) (cancontain fridgetype mugtype) (pickupable baseballbat_1) (pickupable tomato_2) (cleanable tomato_2) (heatable tomato_2) (coolable tomato_2) (sliceable tomato_2) (pickupable ladle_3) (cleanable ladle_3) (pickupable baseballbat_4) (pickupable mug_5) (isreceptacleobject mug_5) (cleanable mug_5) (heatable mug_5) (coolable mug_5) (receptacleatlocation countertop_1 location5) (receptacleatlocation sidetable_2 location1) (receptacleatlocation microwave_3 location2) (receptacleatlocation desk_4 location5) (receptacleatlocation microwave_5 location4) (receptacleatlocation microwave_6 location5) (receptacleatlocation fridge_7 location2) (inreceptacle baseballbat_1 countertop_1) (inreceptacle tomato_2 fridge_7) (inreceptacle ladle_3 countertop_1) (inreceptacle baseballbat_4 sidetable_2) (inreceptacle mug_5 fridge_7) (objectatlocation baseballbat_1 location5) (objectatlocation tomato_2 location2) (objectatlocation ladle_3 location5) (objectatlocation baseballbat_4 location1) (objectatlocation mug_5 location2) (atlocation agent1 location2) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o1 - obj)
 (and (inreceptacle ?o1 ?r) (objecttype_0 ?o1 tomatotype) (receptacletype_0 ?r sidetabletype) (exists (?o2 - obj)
 (and (not (= ?o1 ?o2)) (objecttype_0 ?o2 ladletype) (receptacletype_0 ?r sidetabletype) (inreceptacle ?o2 ?r))))))))
 (:metric minimize (total-cost))
)

; plan
1. (pickupobject agent1 location2 tomato_2 fridge_7)
   deleted: (inreceptacle tomato_2 fridge_7) (objectatlocation tomato_2 location2)
   added: (holds agent1 tomato_2) (holdsany agent1)
   goals met: 0 of 1
2. (gotolocation agent1 location2 location1)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
3. (putobject agent1 location1 tomato_2 sidetable_2 tomatotype sidetabletype)
   deleted: (holds agent1 tomato_2) (holdsany agent1)
   added: (inreceptacle tomato_2 sidetable_2) (objectatlocation tomato_2 location1)
   goals met: 0 of 1
4. (gotolocation agent1 location1 location5)
   deleted: (atlocation agent1 location1)
   added: (atlocation agent1 location5)
   goals met: 0 of 1
5. (pickupobject agent1 location5 ladle_3 countertop_1)
   deleted: (inreceptacle ladle_3 countertop_1) (objectatlocation ladle_3 location5)
   added: (holds agent1 ladle_3) (holdsany agent1)
   goals met: 0 of 1
6. (gotolocation agent1 location5 location1)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
7. (putobject agent1 location1 ladle_3 sidetable_2 ladletype sidetabletype)
   deleted: (holds agent1 ladle_3) (holdsany agent1)
   added: (inreceptacle ladle_3 sidetable_2) (objectatlocation ladle_3 location1)
   goals met: 1 of 1
